---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentReloadedLatestEventArgs
source: html/0e00db2f-a160-8922-e993-346a9040bc5d.htm
---
# Autodesk.Revit.DB.Events.DocumentReloadedLatestEventArgs

The event arguments used by the DocumentReloadedLatestEvent event.
 This event will be raised when executing pull a latest changes from a central model.

## Syntax (C#)
```csharp
public class DocumentReloadedLatestEventArgs : RevitAPIPostDocEventArgs
```